app/controllers/api/v1/favorites_controller.rb

SELECT "viewers".* FROM "viewers" WHERE "viewers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def assign_favorite
          @viewer = Viewer.find(favorite_params)