app/controllers/api/v1/movies_controller.rb

SELECT "genres".* FROM "genres" INNER JOIN "genres_movies" ON "genres"."id" = "genres_movies"."genre_id" WHERE "genres_movies"."movie_id" = $1  [["movie_id", 1]]
SELECT "movies".* FROM "movies" LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
---
      def index
        page = params[:page] || 1
        @movies = Movie.includes(:genres).paginate(page: page,per_page: 10)
        @favorited_movie_ids = @username.movies.each(&:id)